Mermaid graphs
